const csv = `
48.30, 32.16, Кропивницький, 200000
#44.38, 34.33, Алушта, 31440
49.46, 30.17, Біла Церква, 200131
49.54, 28.49, Бердичів, 87575
46.49, 36.58, Бердянськ, 121692
49.15, 28.41, Вінниця, 356665
#45.40, 34.29, Джанкой, 43343
48.28, 34.47, Кам'янське, 255841
48.31, 35.08, Дніпро, 1065008
48.03, 37.47, Донецьк, 1016194
50.18, 28.49, Житомир, 284236
49.04, 28.12, Жмеринка, 37349
47.53, 35.23, Запоріжжя, 815256
#
#45.11, 33.28, Євпаторія, 105915
48.56, 24.53, Івано-Франківськ, 218359
48.43, 26.45, Кам'янець-Подільський, 99610
#45.20, 36.38, Керч, 157007
50.27, 30.30, Київ, 2611327
48.31, 32.21, Кропивницький, 254103
49.07, 33.35, Кременчук, 234073
47.54, 33.33, Кривий Ріг, 668980
48.36, 39.22, Луганськ, 463097
50.49, 25.26, Луцьк, 208816
49.53, 24.16, Львів, 732818
47.07, 37.40, Маріуполь, 492176
46.53, 35.25, Мелітополь, 160657
46.58, 32.12, Миколаїв, 514136
48.26, 22.45, Мукачево, 82346
47.37, 34.30, Нікополь, 136280
46.29, 30.44, Одеса, 1029049
48.33, 35.57, Павлоград, 118816
49.37, 34.37, Полтава, 317998
50.39, 26.26, Рівне, 248813
49.33, 23.23, Самбір, 36556
#44.29, 33.43, Севастополь, 342451
#44.55, 34.13, Сімферополь, 343644
50.58, 34.52, Суми, 293141
49.37, 25.47, Тернопіль, 227755
48.40, 22.30, Ужгород, 117317
#
50.05, 30.03, Фастів, 51976
#45.02, 35.31, Феодосія, 74669
50.02, 36.14, Харків, 1470902
46.40, 32.42, Херсон, 328360
49.26, 27.06, Хмельницький, 253994
48.11, 23.40, Хуст, 29080
49.27, 32.03, Черкаси, 295414
51.29, 31.22, Чернігів, 304994
48.16, 26.07, Чернівці, 240621
#44.26, 34.19, Ялта, 81654
48.20, 37.42, Авдіївка, 37210
48.32, 38.37, Алчевськ, 119193
46.17, 29.35, Арциз, 16370
49.57, 31.37, Баришівка, 10795
49.27, 32.03, Бахмач, 18797
48.35, 38.00, Бахмут, 82916
44.45, 33.52, Бахчисарай, 27549
47.24, 32.28, Баштанка, 13146
49.57, 23.58, Белз, 2478
46.45, 36.46, Білозерка, 9621
49.52, 28.16, Бершадь, 13336
49.44, 24.31, Бібрка, 3980
50.22, 30.31, Боярка, 35968
50.30, 30.47, Бровари, 86839
49.54, 24.54, Броди, 23239
48.06, 38.25, Бунге, 17813
51.10, 33.49, Буринь, 11678
49.15, 24.39, Бурштин, 15298
49.57, 24.38, Буськ, 8673
50.33, 30.13, Буча, 28533
#
49.03, 25.23, Бучач, 12549
49.51, 35.36, Валки, 10
49.82, 36.14, Мерефа, 21764
48.01, 37.49, Моспине, 10795
49.33, 29.35, Погребище, 9871
49.52, 34.33, Решетилівка, 9445
47.22, 38.39, Новоазовськ, 12702
48.21, 38.07, Чистякове, 53725
47.46, 38.29, Сніжне, 48202
46.42, 36.57, Приморськ, 12145
49.25, 31.25, Канів, 26244
49.88, 30.22, Корсунь-Шевченківський, 18765
50.15, 30.15, Українка, 16279
49.55, 30.22, Миронівка, 13041
46.22, 30.40, Білгород-Дністровський, 51890
46.10, 29.47, Татарбунари, 10797
46.10, 29.47, Сарата, 4449
48.35, 39.19, Молодогвардійськ, 23510
47.50, 39.46, Красний Луч, 82729
48.40, 39.08, Антрацит, 63698
49.33, 39.40, Сватове, 19495
49.13, 38.22, Кремінна, 20453
49.02, 39.02, Рубіжне, 65322
48.55, 38.29, Лисичанськ, 115229
48.51, 38.20, Сєвєродонецьк, 119940
48.39, 38.16, Гірське, 10547
48.43, 38.18, Золоте, 17836
47.59, 39.42, Міусинськ, 5506
48.06, 39.25, Петровське, 13256
48.03, 38.22, Хрустальний, 94826
48.06, 38.25, Юнокомунарівськ, 17813
`;

function textChanger(csv) {
    const changeCSV = csv
        .trim()
        .split('\n')
        .filter(elem => !elem.includes("#"))
        .map(elem => {
            const [x, y, city, population] = elem
                .split(',')
                .map(item => item.trim());
            return [x, y, city, Number(population)];
        })
        .sort((a, b) => b[3] - a[3])
        .slice(0, 10)
        .reduce((acc, [x, y, city, population], index) => {
            acc[city.trim()] = {
                population,
                rank: index + 1,
                x: Number(x),
                y: Number(y)
            };
            return acc;
        }, {});

    const cities = Object.keys(changeCSV);
    const regEx = new RegExp(`(${cities.join("|")})`, "g");

    return newText => {
        return newText.replace(regEx, match => {
            const { population, rank } = changeCSV[match];
            return `${match} (${rank} місце в ТОП-10 найбільших міст України, населення ${population})`;
        });
    };
}

// chek result
const sourceText = textChanger(csv);
const inputText = "Київ, Харків і Одеса — великі міста.";

console.log(sourceText(inputText));